zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/samv71q-pinctrl.h
/* pc30a_ebi_a12 */
#define PC30A_EBI_A12 \
	SAM_PINMUX(c, 30, a, periph)

/* pc30b_tc1_tiob5 */
#define PC30B_TC1_TIOB5 \
	SAM_PINMUX(c, 30, b, periph)

/* pc30c_spi1_npcs3 */
#define PC30C_SPI1_NPCS3 \
	SAM_PINMUX(c, 30, c, periph)

/* pc30x_afe1_ad5 */
#define PC30X_AFE1_AD5 \
	SAM_PINMUX(c, 30, x, extra)

/* pc31_gpio */
#define PC31_GPIO \
	SAM_PINMUX(c, 31, gpio, gpio)

/* pc31a_ebi_a13 */
#define PC31A_EBI_A13 \
	SAM_PINMUX(c, 31, a, periph)

/* pc31b_tc1_tclk5 */
#define PC31B_TC1_TCLK5 \
	SAM_PINMUX(c, 31, b, periph)

/* pc31x_afe1_ad6 */
#define PC31X_AFE1_AD6 \
	SAM_PINMUX(c, 31, x, extra)

/* pd0_gpio */
#define PD0_GPIO \
	SAM_PINMUX(d, 0, gpio, gpio)

/* pd0a_gmac_gtxck */
#define PD0A_GMAC_GTXCK \
	SAM_PINMUX(d, 0, a, periph)

/* pd0b_pwmc1_pwml0 */
#define PD0B_PWMC1_PWML0 \
	SAM_PINMUX(d, 0, b, periph)

/* pd0c_spi1_npcs1 */
#define PD0C_SPI1_NPCS1 \
	SAM_PINMUX(d, 0, c, periph)

/* pd0d_usart0_dcd */
#define PD0D_USART0_DCD \
	SAM_PINMUX(d, 0, d, periph)

/* pd0x_dacc_dac1 */
#define PD0X_DACC_DAC1 \
	SAM_PINMUX(d, 0, x, extra)

/* pd1_gpio */
#define PD1_GPIO \
	SAM_PINMUX(d, 1, gpio, gpio)

/* pd1a_gmac_gtxen */
#define PD1A_GMAC_GTXEN \
	SAM_PINMUX(d, 1, a, periph)

/* pd1b_pwmc1_pwmh0 */
#define PD1B_PWMC1_PWMH0 \
	SAM_PINMUX(d, 1, b, periph)

/* pd1c_spi1_npcs2 */
#define PD1C_SPI1_NPCS2 \
	SAM_PINMUX(d, 1, c, periph)

/* pd1d_usart0_dtr */
#define PD1D_USART0_DTR \
	SAM_PINMUX(d, 1, d, periph)

/* pd2_gpio */
#define PD2_GPIO \
	SAM_PINMUX(d, 2, gpio, gpio)

/* pd2a_gmac_gtx0 */
#define PD2A_GMAC_GTX0 \
	SAM_PINMUX(d, 2, a, periph)

/* pd2b_pwmc1_pwml1 */
#define PD2B_PWMC1_PWML1 \
	SAM_PINMUX(d, 2, b, periph)

/* pd2c_spi1_npcs3 */
#define PD2C_SPI1_NPCS3 \
	SAM_PINMUX(d, 2, c, periph)

/* pd2d_usart0_dsr */
#define PD2D_USART0_DSR \
	SAM_PINMUX(d, 2, d, periph)

/* pd3_gpio */
#define PD3_GPIO \
	SAM_PINMUX(d, 3, gpio, gpio)

/* pd3a_gmac_gtx1 */
#define PD3A_GMAC_GTX1 \
	SAM_PINMUX(d, 3, a, periph)

/* pd3b_pwmc1_pwmh1 */
#define PD3B_PWMC1_PWMH1 \
	SAM_PINMUX(d, 3, b, periph)

/* pd3c_uart4_txd */
#define PD3C_UART4_TXD \
	SAM_PINMUX(d, 3, c, periph)

/* pd3d_usart0_ri */
#define PD3D_USART0_RI \
	SAM_PINMUX(d, 3, d, periph)

/* pd4_gpio */
#define PD4_GPIO \
	SAM_PINMUX(d, 4, gpio, gpio)

/* pd4a_gmac_grxdv */
#define PD4A_GMAC_GRXDV \
	SAM_PINMUX(d, 4, a, periph)

/* pd4b_pwmc1_pwml2 */
#define PD4B_PWMC1_PWML2 \
	SAM_PINMUX(d, 4, b, periph)

/* pd4c_trace_d0 */
#define PD4C_TRACE_D0 \
	SAM_PINMUX(d, 4, c, periph)

/* pd4d_usart2_dcd */
#define PD4D_USART2_DCD \
	SAM_PINMUX(d, 4, d, periph)

/* pd5_gpio */
#define PD5_GPIO \
	SAM_PINMUX(d, 5, gpio, gpio)

/* pd5a_gmac_grx0 */
#define PD5A_GMAC_GRX0 \
	SAM_PINMUX(d, 5, a, periph)

/* pd5b_pwmc1_pwmh2 */
#define PD5B_PWMC1_PWMH2 \
	SAM_PINMUX(d, 5, b, periph)

/* pd5c_trace_d1 */
#define PD5C_TRACE_D1 \
	SAM_PINMUX(d, 5, c, periph)

/* pd5d_usart2_dtr */
#define PD5D_USART2_DTR \
	SAM_PINMUX(d, 5, d, periph)

/* pd6_gpio */
#define PD6_GPIO \
	SAM_PINMUX(d, 6, gpio, gpio)

/* pd6a_gmac_grx1 */
#define PD6A_GMAC_GRX1 \
	SAM_PINMUX(d, 6, a, periph)

/* pd6b_pwmc1_pwml3 */
#define PD6B_PWMC1_PWML3 \
	SAM_PINMUX(d, 6, b, periph)

/* pd6c_trace_d2 */
#define PD6C_TRACE_D2 \
	SAM_PINMUX(d, 6, c, periph)

/* pd6d_usart2_dsr */
#define PD6D_USART2_DSR \
	SAM_PINMUX(d, 6, d, periph)

/* pd7_gpio */
#define PD7_GPIO \
	SAM_PINMUX(d, 7, gpio, gpio)

/* pd7a_gmac_grxer */
#define PD7A_GMAC_GRXER \
	SAM_PINMUX(d, 7, a, periph)

/* pd7b_pwmc1_pwmh3 */
#define PD7B_PWMC1_PWMH3 \
	SAM_PINMUX(d, 7, b, periph)

/* pd7c_trace_d3 */
#define PD7C_TRACE_D3 \
	SAM_PINMUX(d, 7, c, periph)

/* pd7d_usart2_ri */
#define PD7D_USART2_RI \
	SAM_PINMUX(d, 7, d, periph)

/* pd8_gpio */
#define PD8_GPIO \
	SAM_PINMUX(d, 8, gpio, gpio)

/* pd8a_gmac_gmdc */
#define PD8A_GMAC_GMDC \
	SAM_PINMUX(d, 8, a, periph)

/* pd8b_pwmc0_pwmfi1 */
#define PD8B_PWMC0_PWMFI1 \
	SAM_PINMUX(d, 8, b, periph)

/* pd8d_trace_clk */
#define PD8D_TRACE_CLK \
	SAM_PINMUX(d, 8, d, periph)

/* pd9_gpio */
#define PD9_GPIO \
	SAM_PINMUX(d, 9, gpio, gpio)

/* pd9a_gmac_gmdio */
#define PD9A_GMAC_GMDIO \
	SAM_PINMUX(d, 9, a, periph)

/* pd9b_pwmc0_pwmfi2 */
#define PD9B_PWMC0_PWMFI2 \
	SAM_PINMUX(d, 9, b, periph)

/* pd9c_afe1_adtrg */
#define PD9C_AFE1_ADTRG \
	SAM_PINMUX(d, 9, c, periph)

/* pd10_gpio */
#define PD10_GPIO \
	SAM_PINMUX(d, 10, gpio, gpio)

/* pd10a_gmac_gcrs */
#define PD10A_GMAC_GCRS \
	SAM_PINMUX(d, 10, a, periph)

/* pd10b_pwmc0_pwml0 */
#define PD10B_PWMC0_PWML0 \
	SAM_PINMUX(d, 10, b, periph)

/* pd10c_ssc_td */
#define PD10C_SSC_TD \
	SAM_PINMUX(d, 10, c, periph)

/* pd10d_mlb_sig */
#define PD10D_MLB_SIG \
	SAM_PINMUX(d, 10, d, periph)

/* pd11_gpio */
#define PD11_GPIO \
	SAM_PINMUX(d, 11, gpio, gpio)

/* pd11a_gmac_grx2 */
#define PD11A_GMAC_GRX2 \
	SAM_PINMUX(d, 11, a, periph)

/* pd11b_pwmc0_pwmh0 */
#define PD11B_PWMC0_PWMH0 \
	SAM_PINMUX(d, 11, b, periph)

/* pd11c_gmac_gtsucomp */
#define PD11C_GMAC_GTSUCOMP \
	SAM_PINMUX(d, 11, c, periph)

/* pd11d_isi_d5 */
#define PD11D_ISI_D5 \
	SAM_PINMUX(d, 11, d, periph)

/* pd12_gpio */
#define PD12_GPIO \
	SAM_PINMUX(d, 12, gpio, gpio)

/* pd12a_gmac_grx3 */
#define PD12A_GMAC_GRX3 \
	SAM_PINMUX(d, 12, a, periph)

/* pd12b_can1_tx */
#define PD12B_CAN1_TX \
	SAM_PINMUX(d, 12, b, periph)

/* pd12c_spi0_npcs2 */
#define PD12C_SPI0_NPCS2 \
	SAM_PINMUX(d, 12, c, periph)

/* pd12d_isi_d6 */
#define PD12D_ISI_D6 \
	SAM_PINMUX(d, 12, d, periph)

/* pd13_gpio */
#define PD13_GPIO \
	SAM_PINMUX(d, 13, gpio, gpio)

/* pd13a_gmac_gcol */
#define PD13A_GMAC_GCOL \
	SAM_PINMUX(d, 13, a, periph)

/* pd13c_ebi_sda10 */
#define PD13C_EBI_SDA10 \
	SAM_PINMUX(d, 13, c, periph)

/* pd14_gpio */
#define PD14_GPIO \
	SAM_PINMUX(d, 14, gpio, gpio)

/* pd14a_gmac_grxck */
#define PD14A_GMAC_GRXCK \
	SAM_PINMUX(d, 14, a, periph)

/* pd14c_ebi_sdcke */
#define PD14C_EBI_SDCKE \
	SAM_PINMUX(d, 14, c, periph)

/* pd15_gpio */
#define PD15_GPIO \
	SAM_PINMUX(d, 15, gpio, gpio)

/* pd15a_gmac_gtx2 */
#define PD15A_GMAC_GTX2 \
	SAM_PINMUX(d, 15, a, periph)

/* pd15b_usart2_rxd */
#define PD15B_USART2_RXD \
	SAM_PINMUX(d, 15, b, periph)

/* pd15c_ebi_nwr1_nbs1 */
#define PD15C_EBI_NWR1_NBS1 \
	SAM_PINMUX(d, 15, c, periph)

/* pd16_gpio */
#define PD16_GPIO \
	SAM_PINMUX(d, 16, gpio, gpio)

/* pd16a_gmac_gtx3 */
#define PD16A_GMAC_GTX3 \
	SAM_PINMUX(d, 16, a, periph)

